tests/load/booking-flow.yml
config:
  target: "{{ $processEnvironment.TARGET_URL }}" # Set via env var, e.g., TARGET_URL=http://localhost:4000
  phases:
    - duration: 60
      arrivalRate: 10
      rampTo: 100
      name: "Ramp up to 100 concurrent users"
  environments:
    local:
      target: "http://localhost:4000"
    aws:
      target: "{{ $processEnvironment.TARGET_URL }}"
  variables:
    departureAirport:
      - "CMB"
      - "LHR"
      - "DXB"
      - "SIN"
    arrivalAirport:
      - "DXB"
      - "JFK"
      - "SYD"
      - "SIN"
    date:
      - "2026-06-10"
      - "2026-06-11"
      - "2026-06-12"
      - "2026-06-15"

scenarios:
  - name: "Flight Search DDOS Simulation"
    flow:
      - loop:
        - get:
            url: "/api/v1/flights/search?departureAirport={{ departureAirport }}&arrivalAirport={{ arrivalAirport }}&date={{ date }}"
        - think: 1
        count: 5